niganma12345/stm32-flight-controller/flight/Core/Src/App_task.c
#include "App_task.h"
#include "FreeRTOS.h"
#include "task.h"
#include "main.h"
#include "motor.h"
#include "NRF24L01.h"
#include "App_flight.h"
#include "App_receive_data.h"
#include "led.h"
#include "BlueSerial.h"
#include "App_oled.h"



static volatile TickType_t g_last_rx_tick = 0;  /* 通信超时保护：记录最后一次收到有效数据的时间戳 */
#define COMM_TIMEOUT_MS     150    /* 超时阈值：150ms 无数据则自动停转 */
#define CYCLE_TIME          6      /* 飞控 / 通讯 / LED 主循环周期 (ms) */
#define POWER_TASK_PERIOD   10000  /* 电源管理任务周期 (ms) */
volatile Flight_State flight_state = LOCKED;           /* 飞行状态（32位原子读写） */
QueueHandle_t       remote_data_queue = NULL;          /* 遥控数据队列（深度1） */
QueueHandle_t       telemetry_queue = NULL;            /* 遥测数据队列（深度1） */
EventGroupHandle_t  flight_evt_group = NULL;           /* 飞行事件组 */


/**
 * @brief FreeRTOS Tick Hook - called from the SysTick ISR on every RTOS tick.
 *        We use this to keep the HAL timebase running.
 */
void vApplicationTickHook(void)
{
    HAL_IncTick();
}


#define START_TASK_STACK 128
#define START_TASK_PRIORITY 1
TaskHandle_t start_task_handle;
void start_task(void *pvParameters);

//飞控任务
#define FLIGHT_TASK_STACK 512
#define FLIGHT_TASK_PRIORITY 2
TaskHandle_t flight_task_handle;
void flight_task(void *pvParameters);

//通讯任务
#define NRF24L01_TASK_STACK 256
#define NRF24L01_TASK_PRIORITY 3
TaskHandle_t nrf24l01_task_handle;
void nrf24l01_task(void *pvParameters);

//LED灯控任务
#define LED_TASK_STACK 128
#define LED_TASK_PRIORITY 1
TaskHandle_t led_task_handle;
void led_task(void *pvParameters);

//电源管理任务
#define POWER_MGMT_TASK_STACK 128
#define POWER_MGMT_TASK_PRIORITY 1
TaskHandle_t power_mgmt_task_handle;
void power_mgmt_task(void *pvParameters);

/**
 * @brief  创建启动任务，启动 FreeRTOS 调度器
 */
void freertos_start(void)
{

    xTaskCreate((TaskFunction_t)start_task,
                (char *)"start_task",
                (configSTACK_DEPTH_TYPE)START_TASK_STACK,
                (void *)NULL,
                (UBaseType_t)START_TASK_PRIORITY,
                (TaskHandle_t *)&start_task_handle);


    vTaskStartScheduler();
}

/**
 * @brief  创建所有 FreeRTOS 内核对象和子任务，完成后自删除
 */
void start_task(void *pvParameters)
{

    /* 初始化蓝牙串口 */
    BlueSerial_Init();

    /* 创建遥控数据队列（深度1，永远只保留最新值） */
    remote_data_queue = xQueueCreate(1, sizeof(Remote_Data));

    /* 创建遥测数据队列（深度1） */
    telemetry_queue = xQueueCreate(1, sizeof(Telemetry_t));

    /* 创建飞行事件组（初始 CONNECTED 已置位） */
    flight_evt_group = xEventGroupCreate();
    xEventGroupSetBits(flight_evt_group, EVT_REMOTE_CONNECTED);  /* 初始化事件组 */

    xTaskCreate((TaskFunction_t)flight_task,
                (char *)"flight_task",
                (configSTACK_DEPTH_TYPE)FLIGHT_TASK_STACK,
                (void *)NULL,
                (UBaseType_t)FLIGHT_TASK_PRIORITY,
                (TaskHandle_t *)&flight_task_handle);
    xTaskCreate((TaskFunction_t)nrf24l01_task,
                (char *)"nrf24l01_task",
                (configSTACK_DEPTH_TYPE)NRF24L01_TASK_STACK,
                (void *)NULL,
                (UBaseType_t)NRF24L01_TASK_PRIORITY,
                (TaskHandle_t *)&nrf24l01_task_handle);
    xTaskCreate((TaskFunction_t)led_task,
                (char *)"led_task",
                (configSTACK_DEPTH_TYPE)LED_TASK_STACK,
                (void *)NULL,
                (UBaseType_t)LED_TASK_PRIORITY,
                (TaskHandle_t *)&led_task_handle);
    xTaskCreate((TaskFunction_t)power_mgmt_task,
                (char *)"power_mgmt_task",
                (configSTACK_DEPTH_TYPE)POWER_MGMT_TASK_STACK,
                (void *)NULL,
                (UBaseType_t)POWER_MGMT_TASK_PRIORITY,
                (TaskHandle_t *)&power_mgmt_task_handle);

    /* OLED: 先创建队列，再创建任务 */
    App_OLED_Init();
    xTaskCreate((TaskFunction_t)App_OLED_Task,
                (char *)"oled_task",
                (configSTACK_DEPTH_TYPE)APP_OLED_TASK_STACK,
                (void *)NULL,
                (UBaseType_t)APP_OLED_TASK_PRIORITY,
                (TaskHandle_t *)NULL);

    vTaskDelete(NULL);

}

/**
 * @brief  飞行控制任务（6ms 周期）
 *         姿态解算 → 磁力计 → 传感器融合 → PID → 电机输出 → OLED
 */
void flight_task(void *pvParameters)
{
    TickType_t last_wake_time = xTaskGetTickCount();

    App_flight_init();
    while (1)
    {
        TickType_t now = xTaskGetTickCount();

        /* ---- 通信超时保护 ---- */
        if ((flight_state == NORMAL || flight_state == FIX_HEIGHT || flight_state == MANUAL) &&
            (now - g_last_rx_tick) > pdMS_TO_TICKS(COMM_TIMEOUT_MS))
        {
            flight_state = FAIL;
        }

        /* ---- 从队列读取遥控数据快照（本周期内所有函数共用一份）---- */
        Remote_Data rc;
        if (xQueuePeek(remote_data_queue, &rc, 0) != pdTRUE)  /* 读队列 */
        {
            /* 队列为空（尚未收到任何遥控数据），使用安全默认值 */
            rc.thr = 0;
            rc.yaw = 500;
            rc.pit = 500;
            rc.rol = 500;
            rc.shutdown = 0;
            rc.fix_height = 0;
        }

        // 1. 姿态解算
        App_flight_get_euler_angle();

        // 2. 磁力计（读取 + 航向 + 硬铁校准）
        App_flight_process_mag();

        // 3. 光流/陀螺/高度传感器（内部 30ms 分频）
        App_flight_process_flow_sensors();

        // 4. PID 控制
        App_flight_pid_process(&rc);

        // 5. 定高 PID（每 24ms = 4 周期）
        {
            static uint8_t height_tick = 0;
            if (++height_tick >= 4)
            {
                height_tick = 0;
                App_flight_fix_height_pid_process(&rc);
            }
        }

        // 6. 电机输出
        App_flight_control_motor(&rc);

        // 7. OLED 显示
        App_flight_display();

        // 8. 遥测数据打包 → 队列（每 100ms，供 nrf24l01_task 回传）
        {
            static uint8_t tel_tick = 0;
            if (++tel_tick >= 17)
            {
                tel_tick = 0;
                Telemetry_t tel;
                tel.altitude     = g_fused_height;
                tel.flight_state = (uint8_t)flight_state;
                tel.flow_x       = (g_flow_data.disp.delta_x != 0);
                tel.flow_y       = (g_flow_data.disp.delta_y != 0);
                xQueueOverwrite(telemetry_queue, &tel);  /* 写队列 */
            }
        }

        vTaskDelayUntil(&last_wake_time, pdMS_TO_TICKS(CYCLE_TIME));
    }
}

/**
 * @brief  NRF24L01 收发任务（6ms 周期）
 *         - 接收遥控数据 → 校验 → 写入队列
 *         - 维护连接状态（事件组）和飞行状态机
 *         - 收到数据后每 200ms 回传遥测（高度/电压/光流方向）
 *         - 更新 g_last_rx_tick 供 flight_task 超时判断
 */
void nrf24l01_task(void *pvParameters)
{

    NRF24L01_Init();
    g_last_rx_tick = xTaskGetTickCount();   /* 初始化时间戳，避免上电即超时 */
    static TickType_t last_alt_tick = 0;
    last_alt_tick = xTaskGetTickCount();

    while (1)
    {
        /* ---- 接收遥控数据、校验、应答（由 App_receive_data 模块完成） ---- */
        uint8_t rx_result = App_receive_data();

        /* 提前保存关机标志：App_process_flight_state 会清零，必须在调用之前读取 */
        Remote_Data rd;
        uint8_t shutdown_req = 0;
        if (xQueuePeek(remote_data_queue, &rd, 0) == pdTRUE)  /* 读队列 */
            shutdown_req = rd.shutdown;

        /* ---- 处理遥控器连接状态 ---- */
        App_process_connect_state(rx_result);

        /* ---- 处理飞行状态机（解锁/定高/故障） ---- */
        App_process_flight_state();
        /* ---- 关机命令 → 通知电源管理任务 ---- */
        if (shutdown_req == 1)
            xTaskNotifyGive(power_mgmt_task_handle);


        /* 接收成功时更新最后收包时间戳 */
        if (rx_result == 0)
        {
            g_last_rx_tick = xTaskGetTickCount();

            /* ---- 每 200ms 回传遥测数据 ---- */
            TickType_t now = xTaskGetTickCount();
            if ((now - last_alt_tick) >= pdMS_TO_TICKS(200))
            {
                last_alt_tick = now;
                App_send_telemetry();
            }
        }


        /* ---- 每 ~102ms 蓝牙输出：高度 + 光流真实位移（使用 flight_task 已处理的数据）---- */
        {
            static uint8_t  blue_tick = 0;
            if (++blue_tick >= 17)   /* 17 × 6ms ≈ 102ms */
            {
                blue_tick = 0;
                  /*江协蓝牙串口*/
                BlueSerial_Printf("[plot,%d,%d,%d]",
                                  g_flow_height_mm,
                                  (int)g_flow_data.vx,
                                  (int)g_flow_data.vy);
//				          /*vofa+蓝牙*/
//							  BlueSerial_Printf(":%d,%d,%d\n",
//                                  g_flow_height_mm,
//                                  (int)g_flow_data.vx,
//                                  (int)g_flow_data.vy);
            }
        }

        vTaskDelay(6);

    }
}

/**
 * @brief  LED 灯控任务（6ms 周期）
 *         LED0: 通讯状态 — 连接常亮，断开 500ms 后灭
 *         LED1: 飞行状态 — LOCKED 慢闪，解锁常亮，FAIL 灭
 */
void led_task(void *pvParameters)
{
    Led_Init();

    TickType_t last_wake = xTaskGetTickCount();

    while (1)
    {
        Led_Process();

        vTaskDelayUntil(&last_wake, pdMS_TO_TICKS(6));
    }
}

/**
 * @brief  TP4336 电源管理任务
 *         收到任务通知 → 双击脉冲关机；否则每 10s 单次脉冲维持供电
 */
void power_mgmt_task(void *pvParameters)
{
    TickType_t last_wake = xTaskGetTickCount();

    while (1)
    {
			 uint32_t res = ulTaskNotifyTake(pdTRUE, POWER_TASK_PERIOD);
        if (res != 0)
        {
            // 两次短按关机(100ms低/200ms高/100ms低)
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, GPIO_PIN_RESET);
            vTaskDelay(pdMS_TO_TICKS(100));
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, GPIO_PIN_SET);
            vTaskDelay(pdMS_TO_TICKS(200));

            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, GPIO_PIN_RESET);
            vTaskDelay(pdMS_TO_TICKS(100));
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, GPIO_PIN_SET);
        }
        else
        {
            // 单次短按保持供电
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, GPIO_PIN_RESET);
            vTaskDelay(pdMS_TO_TICKS(100));
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, GPIO_PIN_SET);
					  vTaskDelayUntil(&last_wake, POWER_TASK_PERIOD);
        }
    }
}
